{"data":{"site":{"siteMetadata":{"title":"Afito Blogs","author":"Tom Bonanni"}},"markdownRemark":{"id":"8c017db1-2fcf-5df3-910b-c1b18b1e726b","excerpt":"Searching around to find great landlords at SUNY Cortland can be a time-consuming task, especially if you’re moving off campus for the first time. No one wants…","html":"<p>Searching around to find great landlords at SUNY Cortland can be a time-consuming task, especially if you’re moving off campus for the first time. No one wants to find themselves in a less than desirable living situation while working their way through school. Thankfully, we at Afito have gotten to know almost every college landlord in the area. Here’s our list of the best landlords at SUNY Cortland:</p>\n<p><a href=\"https://afito.com/landlord/252\">Gary Baccile</a></p>\n<p>Gary Baccile has been renting to students in the Cortland area for the past eight years. With the help of his maintenance specialist Kip Fox, who has over thirty years of experience in property management, Gary owns and manages seven student rentals around town.</p>\n<p><a href=\"https://afito.com/landlord/253\">Ithacor</a></p>\n<p>Ithacor is a local property management company serving Cortland as well as several other cities and towns in the area. They work with area property owners to manage their rental houses efficiently and effectively, and have over fifteen years of experience in the space. They are well known for being responsive and accommodating to tenant concerns.</p>\n<p><a href=\"https://afito.com/landlord/224\">Calabro Properties</a></p>\n<p>Calabro Properties offers many housing options to student tenants, all of which are a quick walk to campus and downtown. Single person one bedroom apartments all the way up to houses for large groups of 9+ students are available. Each and every apartment is fully furnished and recently renovated, with such amenities as flat screen televisions, in-unit laundry facilities, and snow removal services.</p>\n<p><a href=\"https://afito.com/landlord/275\">SV Student Rentals</a></p>\n<p>SV Student rentals is an experienced SUNY Cortland student landlord offering everything from small one bedroom apartments to large 12 bedroom houses. Each property is located within walking distance from campus and downtown. All units are fully furnished and feature included garbage pickup, parking, laundry, and high speed internet.</p>\n<p><a href=\"https://afito.com/landlord/233\">Marc Pace</a></p>\n<p>Marc Pace has been renting to Cortland students for more than 25 years! Marc takes pride in his houses and has each one refurbished and professionally inspected every year. All of his properties are a short walk to campus. Tenants tend to be very happy with Marc and feel that he goes above and beyond as a landlord.</p>\n<p><a href=\"https://afito.com/landlord/237\">Cortland Student Rentals</a></p>\n<p>Cortland Student Rentals, owned and operated by Mark’s brother Keith Pace, has been managing off-campus housing in Cortland since 1979. They take pride in being a local landlord and improving the community in which they live and do business. Tenants can expect a responsive landlord with people on-call around the clock. All units are well furnished and close by to campus and downtown.</p>\n<p><a href=\"https://afito.com/landlord/225\">Michael Pace</a></p>\n<p>It’s not often that you see three brothers at the same school offering great student rental properties. Michael Pace brings forty years of experience in student housing to his properties at Cortland. All units are fully furnished and feature free parking and snow/trash removal. Utilities are included in the rent for most units!</p>\n<p><a href=\"https://afito.com/landlord/247\">Paradigm Properties</a></p>\n<p>Paradigm Properties has been in the SUNY Cortland off campus housing business since 1981. The company strives to provide the highest quality student housing, and pays particular attention to the smart design of its units for student tenants. Paradigm maintains a full-time property manager and maintenance staff and is on call around the clock.</p>\n<p><a href=\"https://afito.com/landlord/232\">Armideo Student Housing</a></p>\n<p>The father-son team behind Armideo Student Housing offers a large number of great student housing options in the Cortland area. Joe Armideo has been renting to students since 1972 and boasts that if your parents went to Cortland, he probably knew them. Apartments feature on-site laundry and new kitchen and bathroom facilities, and parking and snow removal are included in the rent. Unlike some area landlords, Armideo Student Housing allows for rent to be paid monthly.</p>\n<p><a href=\"https://afito.com/landlord/246\">Cortland Off Campus</a></p>\n<p>Serving the SUNY Cortland and TC3 communities for over 30 years, Cortland Off Campus offers some of the best student rentals around. Units are close by to campus as well as downtown and are fully furnished (including with leather couches and large flat-screen televisions.) 24/7 staff are available around the clock for every tenant.</p>\n<p><a href=\"https://afito.com/landlord/288\">Collegetown Rentals</a></p>\n<p>Collegetown Rentals offers many student rental properties at SUNY Cortland, each close by to campus, downtown, and the athletic complexes. All units are fully furnished and feature all-in rental rates which include utilities, laundry, and snow removal. Maintenance staff are on call 24/7 to respond to any issues.</p>\n<p><a href=\"https://afito.com/landlord/278\">Walk2Campus</a></p>\n<p>Walk2Campus has been providing off campus housing since 2004. They strive to maintain beautiful rental units within walking distance to campus and are particularly proud of their values-driven approach to property management. Walk2Campus is committed to leaving a positive impact on the environment and using the most sustainable methods possible to operate their business.</p>\n<p><a href=\"https://afito.com/landlord/279\">RMP Properties</a></p>\n<p>RMP Properties has been in the Cortland off campus housing business since 2003. RMP strives to make student tenants’ lives as easy as possible by providing affordable and all inclusive rental properties. All units are close to campus and are designed to have a positive impact on the environment.</p>\n<p><a href=\"https://afito.com/landlord/301\">JE Management Group</a></p>\n<p>JE Management group provides a variety of houses and apartments near SUNY Cortland and TC3. With over twenty years experience in the business, student tenants can rest assured that they will have an easy leasing and renting experience with JE Management.</p>\n<p><a href=\"https://afito.com/landlord/280\">Working on a Dream Properties</a></p>\n<p>Living by the motto “You work on your dream…we work on the rest,” Working on a Dream Properties provides affordable, high quality student housing just a short walk from campus and downtown. The company features an on-call local manager as well as included utilizes for all units. Working on a Dream places a specific emphasis on providing clean and well-maintained houses and apartments.</p>\n<p>In the unlikely event that you can’t find your home away from home from these outstanding landlords in the SUNY Cortland area, <a href=\"https://afito.com/area/6\">check out Afito</a> to see the rest of the available listings near campus. If you would prefer living in an apartment building, <a href=\"https://blog.afito.com/best-apartments-for-cortland-students/\">check out our article on the best apartments for Cortland students.</a></p>","frontmatter":{"title":"Top Landlords at SUNY Cortland","author":"","twitter":"","instagram":"","medium":"","facebook":"","date":"June 04, 2019","cover":{"childImageSharp":{"fluid":{"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAPABQDASIAAhEBAxEB/8QAGAAAAwEBAAAAAAAAAAAAAAAAAAMGBAX/xAAVAQEBAAAAAAAAAAAAAAAAAAABAP/aAAwDAQACEAMQAAAB1snWR3yfE//EABoQAAMAAwEAAAAAAAAAAAAAAAABAgMRExL/2gAIAQEAAQUCnLHOL9jcbVMVuToj/8QAFhEBAQEAAAAAAAAAAAAAAAAAABEB/9oACAEDAQE/AZiP/8QAFxEBAAMAAAAAAAAAAAAAAAAAAAIREv/aAAgBAgEBPwG5NP/EAB0QAAECBwAAAAAAAAAAAAAAAAABMRAREiEykaH/2gAIAQEABj8Cq4NIyTcLKox//8QAGxABAAICAwAAAAAAAAAAAAAAAQARITFhgZH/2gAIAQEAAT8hQtE7Q8L8ICiLG01HL9cUcz//2gAMAwEAAgADAAAAELDv/8QAFhEBAQEAAAAAAAAAAAAAAAAAAAER/9oACAEDAQE/EIsv/8QAFxEBAAMAAAAAAAAAAAAAAAAAAAERQf/aAAgBAgEBPxCcln//xAAcEAEAAwACAwAAAAAAAAAAAAABABEhQWExcdH/2gAIAQEAAT8QVKZLOnjOLmyShotHtj4c8iLIRdC622kpDvTLiJC/R8n/2Q==","aspectRatio":1.8620689655172413,"src":"/blog/static/4042e19d563cf6851ee4a9dc1b2b5070/fc9a3/cover.jpg","srcSet":"/blog/static/4042e19d563cf6851ee4a9dc1b2b5070/03dbd/cover.jpg 270w,\n/blog/static/4042e19d563cf6851ee4a9dc1b2b5070/97810/cover.jpg 540w,\n/blog/static/4042e19d563cf6851ee4a9dc1b2b5070/fc9a3/cover.jpg 1080w,\n/blog/static/4042e19d563cf6851ee4a9dc1b2b5070/61931/cover.jpg 1600w","sizes":"(max-width: 1080px) 100vw, 1080px"}}}}}},"pageContext":{"slug":"/top-landlords-at-suny-cortland/","previous":{"fields":{"slug":"/best-apartments-for-cortland-students/"},"frontmatter":{"title":"Best Apartments For Cortland Students","author":"Mark Chesler","twitter":"","facebook":"","instagram":"","medium":"","cover":{"childImageSharp":{"fluid":{"aspectRatio":1.75,"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAHABQDASIAAhEBAxEB/8QAFwABAAMAAAAAAAAAAAAAAAAAAAIEBf/EABUBAQEAAAAAAAAAAAAAAAAAAAAB/9oADAMBAAIQAxAAAAGtIjYB/8QAFxAAAwEAAAAAAAAAAAAAAAAAAgMhIv/aAAgBAQABBQJjKnZDR//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQMBAT8BP//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQIBAT8BP//EABgQAQEAAwAAAAAAAAAAAAAAABEBABAh/9oACAEBAAY/AgcLOa//xAAaEAACAwEBAAAAAAAAAAAAAAAAAREhMUFR/9oACAEBAAE/IUqdU0f3Dg8F5R//2gAMAwEAAgADAAAAEIfv/8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAwEBPxA//8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAgEBPxA//8QAGhABAAMAAwAAAAAAAAAAAAAAAQARITFRgf/aAAgBAQABPxBGKrot2oOZPDNHR7HABWtCixZ//9k=","sizes":"(max-width: 700px) 100vw, 700px","src":"/blog/static/756805657db101c313ef9f1d72cfccbc/42d28/cover.jpg","srcSet":"/blog/static/756805657db101c313ef9f1d72cfccbc/00478/cover.jpg 175w,\n/blog/static/756805657db101c313ef9f1d72cfccbc/440e7/cover.jpg 350w,\n/blog/static/756805657db101c313ef9f1d72cfccbc/42d28/cover.jpg 700w,\n/blog/static/756805657db101c313ef9f1d72cfccbc/ff14d/cover.jpg 1050w,\n/blog/static/756805657db101c313ef9f1d72cfccbc/7b527/cover.jpg 1400w,\n/blog/static/756805657db101c313ef9f1d72cfccbc/afda8/cover.jpg 2100w,\n/blog/static/756805657db101c313ef9f1d72cfccbc/ac62f/cover.jpg 5746w"}}}}},"next":null}}